//написати програму, яка приймає на вхід число 
// і виводить у консоль повідомлення залежно від значення числа.
// Якщо число ділиться на 3, то повідомлення має бути Fizz, 
// якщо число ділиться на 5, то повідомлення має бути Buzz, 
// а якщо число ділиться і на 3, і на 5, то повідомлення має бути FizzBuzz. 
// Наприклад, для числа 15 повідомлення має бути FizzBuzz.

//let number = prompt ('Введіть будь-яке ціле число');
//console.log(number);
//if (number % 3 == 0) {
   // message = 'Fizz';
//} else if (number % 5 == 0) {
   // message = 'Buzz';
//} else if (number % 3 != 0 && number % 5 != 0) {
   // message = 'FizzBuzz';
//}
//console.log(message);


// написати програму, яка приймає на вхід число і
// виводить у консоль повідомлення, що вказує, чи є введений рік високосним.

// let year = prompt('Введіть, будь ласка, будь-який рік');
// if (year % 4 === 0 || year % 400 === 0) {
//     message = 'Так, цей рік є високосним';
// }
//  if (year % 100 != 0); {
//     message = 'Цей рік не є високосним';
// }
// console.log(message);


//написати програму, яка приймає на вхід число і
// виводить у консоль повідомлення у форматі Вам N рік / ріки / років. 
//Залежно від числа N слово рік має змінюватися на років або року. 
//Наприклад, Вам 1 рік, Вам 5 років, Вам 42 роки.

let age = prompt('Введіть, будь ласка, скільки Вам років');
let count = age % 100
console.log('count = ', count);
let result = ''
if (count >= 10 && count <= 20) {
    result = 'років'
} else {
    count = age % 10
    console.log('count = ', count);
} if (count ===1) {
    result = 'рік'
} else if (count >= 2 && count <= 4) {
    result = 'роки'
} else {
    result = 'років'
}
console.log('Вам' + ' ' + age + ' ' + result);